// Запропонуйте користувачу ввести число за допомогою prompt().
// Збережіть введене значення у змінну number.
// Перевірте, чи дорівнює змінна number числу 10:
//    Якщо так – виведіть повідомлення 'Вірно' у alert().
//    Якщо ні – виведіть 'Невірно'. 

// Підказка: prompt завжди повертає рядок (String), тому перед перевіркою  
// перетворіть значення на число за допомогою Number().


/* 
function checkNumber(params) {
    const number = Number(prompt("Введіть число"));
    console.log("number: ", number);
    if (number === 10) {
        alert("Вірно");
    } else {
        alert("Невірно");
    }
}

checkNumber();

*/

// У змінній min лежить випадкове число від 0 до 59.
// Визначте, в яку чверть години потрапляє
// це число (у першу, другу, третю чи четверту).
// Виведіть в alert відповідне повідомлення, наприклад:
// "10 входить в першу чверть"

// const min = Math.floor(Math.random() * (59 - 0) + 0);

/*
function checkQuarter() {
    const min = Math.floor(Math.random() * (59 - 0) + 0);
    if (min >= 0 && min <= 15) {
        alert(`${min} входить в першу чверть`);
    } else if (min > 15 && min <= 30) {
        alert(`${min} входить в другу чверть`);
    } else if (min > 30 && min <= 45) {
        alert(`${min} входить в третю чверть`);
    } else if (min > 45 && min <= 59) {
        alert(`${min} входить в четверту чверть`);
    } else {
        alert("Помилка");
    }
}
*/
// Змінна num може набувати 4 значення: '1', '2', '3' або '4' 
// (запитуй це значення у користувача через prompt). 
// Якщо вона має значення '1', то у змінну result запишіть 'зима',
// якщо має значення '2' - 'весна' і так далі.
// Розв'яжіть завдання через switch-case.
// Не забудьте про дефолтне значення, на випадок, якщо користувач 
// введе в prompt щось інше. В такому випадку result має набувати значення:
// "Вибачте, але ви маєте ввести значення від 1 до 4 включно".
// Значення змінної result виведіть в консоль.

/*
const num = prompt("Введіть число від 1 до 4");
let result;
switch (num) {
    case '1':
        result = 'зима';    
        break;
    case '2':
        result = 'весна';  
        break;
    case '3':
        result = 'літо';  
        break;
    case '4':
        result = 'осінь';  
        break;
    default:
        result = 'Вибачте, але ви маєте ввести значення від 1 до 4 включно';  
        break;
}
console.log(result);

*/

// Отримуйте від користувача число (кількість хвилин) через prompt
// і виводьте у консоль рядок у форматі годин та хвилин.
// Приклад: користувач вводить в prompt '70' -> в консолі відобразиться '01:10'.
// Корисне посилання для відображення годин та хвилин у потрібному форматі ('01' замість '1'): 
// https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/String/padStart#examples

/*
function checkTime() {
    const num = Number.parseInt(prompt("Введіть кількість хвилин"));
    if (!num) {
        alert("Введіть коректне значення!");
    } else {
    const hours = Math.floor(num / 60);
    const min = num % 60;
    console.log(String(hours).padStart(2, '0') + ':' + String(min).padStart(2, '0'));
    }
}

checkTime();
*/

// Напишіть код, який запитуватиме у користувача
// логін за допомогою prompt і виводить результат в консоль браузера

// Після цього додайте перевірку введеного користувачем значення:
// Якщо відвідувач вводить "Адмін",
// то prompt запитує пароль (не забудьте зберігти його у змінну для подальшої перевірки).
// Якщо нічого не ввели або натиснули Cancel,
// Вивести в alert строку "Скасовано"
// В іншому випадку вивести в alert рядок "Я вас не знаю"

// Пароль перевіряти так:
// Якщо введено пароль "Я головний",
// то вивести в alert рядок "Добрий день!",
// в іншому випадку вивести в alert рядок "Невірний пароль!"

/* const login = prompt("Введіть логін");
function checkLogin() {
    if (login === 'Адмін') {
        const password = prompt("Введіть пароль");
        if (password === 'Я головний') {
            alert("Добрий день!");
        } else {
            alert("Невірний пароль!");
        }
    } else if (!login) {
        alert("Скасовано");
    } else {
        alert("Я вас не знаю");
    }
}

checkLogin();
*/

// Напишіть функцію getNumbers(min, max), що приймає 2 параметри - 
// мінімальне і максимальне число відповідно.
// Напишіть цикл всередині функції, який виводить у консоль
// всі числа від max до min за спаданням.
// Окрім цього, підрахуйте суму всіх парних чисел в цьому циклі
// і поверніть її з функції.

/*
function getNumbers(min, max) {
    let sum = 0;

    for (let i = max; i >= min; i--) {
        console.log(i);

        if (i % 2 === 0) {
            sum += i;
        }
    }
    return sum;
}

console.log(getNumbers(1, 20));
*/





    


